cool/tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/system/cellSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name filter;

action new;

topoSetSources
(
    // Cells with cell centre within box
    boxToCell
    {
       box   (1.5 -1 -1) (2 1 1);
    }
);

// ************************************************************************* //
